/* package up error # */
"error %1$d" = "erreur %1$d";
"error %1$#x" = "erreur %1$#x";
/* errno error 0 */
"Unknown error: 0" = "Erreur inconnue : 0";

/* errno error 1 */
"Operation not permitted" = "Opération non permise";

/* errno error 2 */
"No such file or directory" = "Fichier ou répertoire inexistant";

/* errno error 3 */
"No such process" = "Processus inexistant";

/* errno error 4 */
"Interrupted system call" = "Appel du système interrompu";

/* errno error 5 */
"Input/output error" = "Erreur d’entrée/sortie";

/* errno error 6 */
"Device not configured" = "Périphérique non configuré";

/* errno error 7 */
"Argument list too long" = "Liste d’arguments trop longue";

/* errno error 8 */
"Exec format error" = "Erreur de format de l’exéc.";

/* errno error 9 */
"Bad file descriptor" = "Descripteur de fichier incorrect";

/* errno error 10 */
"No child processes" = "Aucun processus enfant";

/* errno error 11 */
"Resource deadlock avoided" = "Blocage des ressources évité";

/* errno error 12 */
"Cannot allocate memory" = "Impossible d’allouer de la mémoire";

/* errno error 13 */
"Permission denied" = "Autorisation refusée";

/* errno error 14 */
"Bad address" = "Adresse incorrecte";

/* errno error 15 */
"Block device required" = "Unité de blocs requise";

/* errno error 16 */
"Resource busy" = "Ressource occupée";

/* errno error 17 */
"File exists" = "Le fichier existe";

/* errno error 18 */
"Cross-device link" = "Lien inter-périphérique";

/* errno error 19 */
"Operation not supported by device" = "Opération non gérée par le périphérique";

/* errno error 20 */
"Not a directory" = "Pas un répertoire";

/* errno error 21 */
"Is a directory" = "Est un répertoire";

/* errno error 22 */
"Invalid argument" = "Paramètre invalide";

/* errno error 23 */
"Too many open files in system" = "Trop de fichiers ouverts dans le système";

/* errno error 24 */
"Too many open files" = "Trop de fichiers ouverts";

/* errno error 25 */
"Inappropriate ioctl for device" = "Appel ioctl incompatible avec le périphérique";

/* errno error 26 */
"Text file busy" = "Fichier texte en service";

/* errno error 27 */
"File too large" = "Fichier trop volumineux";

/* errno error 28 */
"No space left on device" = "Plus d’espace libre sur le périphérique";

/* errno error 29 */
"Illegal seek" = "Recherche invalide";

/* errno error 30 */
"Read-only file system" = "Système de fichiers en lecture seule";

/* errno error 31 */
"Too many links" = "Trop de liens";

/* errno error 32 */
"Broken pipe" = "Canal endommagé";

/* errno error 33 */
"Numerical argument out of domain" = "Argument numérique hors domaine";

/* errno error 34 */
"Result too large" = "Résultat trop volumineux";

/* errno error 35 */
"Resource temporarily unavailable" = "Ressources temporairement indisponibles";

/* errno error 36 */
"Operation now in progress" = "Opération en cours";

/* errno error 37 */
"Operation already in progress" = "Opération déjà en cours";

/* errno error 38 */
"Socket operation on non-socket" = "Opération Socket sur non-socket";

/* errno error 39 */
"Destination address required" = "Adresse de destination requise";

/* errno error 40 */
"Message too long" = "Message trop long";

/* errno error 41 */
"Protocol wrong type for socket" = "Type de protocole incompatible avec socket";

/* errno error 42 */
"Protocol not available" = "Protocole non disponible";

/* errno error 43 */
"Protocol not supported" = "Protocole non géré";

/* errno error 44 */
"Socket type not supported" = "Type de socket non géré";

/* errno error 45 */
"Operation not supported" = "Opération non gérée";

/* errno error 46 */
"Protocol family not supported" = "Famille de protocoles non gérée";

/* errno error 47 */
"Address family not supported by protocol family" = "Famille d’adresses non gérée par la famille de protocoles";

/* errno error 48 */
"Address already in use" = "Adresse déjà en service";

/* errno error 49 */
"Can't assign requested address" = "Impossible d’attribuer l’adresse demandée";

/* errno error 50 */
"Network is down" = "Réseau hors service";

/* errno error 51 */
"Network is unreachable" = "Réseau injoignable";

/* errno error 52 */
"Network dropped connection on reset" = "Le réseau a rompu la connexion à la réinitialisation";

/* errno error 53 */
"Software caused connection abort" = "Interruption de la connexion due au logiciel";

/* errno error 54 */
"Connection reset by peer" = "Connexion réinitialisée par homologue";

/* errno error 55 */
"No buffer space available" = "Plus d’espace libre sur le tampon";

/* errno error 56 */
"Socket is already connected" = "Socket déjà connecté";

/* errno error 57 */
"Socket is not connected" = "Socket non connecté";

/* errno error 58 */
"Can't send after socket shutdown" = "Envoi impossible après l’arrêt du socket";

/* errno error 59 */
"Too many references: can't splice" = "Trop de références : impossible de raccorder";

/* errno error 60 */
"Operation timed out" = "Délai de l’opération dépassé";

/* errno error 61 */
"Connection refused" = "Connexion refusée";

/* errno error 62 */
"Too many levels of symbolic links" = "Trop de niveaux de liens symboliques";

/* errno error 63 */
"File name too long" = "Nom de fichier trop long";

/* errno error 64 */
"Host is down" = "Hôte déconnecté";

/* errno error 65 */
"No route to host" = "Aucun chemin vers l’hôte";

/* errno error 66 */
"Directory not empty" = "Répertoire non vide";

/* errno error 67 */
"Too many processes" = "Trop de processus";

/* errno error 68 */
"Too many users" = "Trop d’utilisateurs";

/* errno error 69 */
"Disc quota exceeded" = "Quota du disque dépassé";

/* errno error 70 */
"Stale NFS file handle" = "Descripteur du fichier NFS hors service";

/* errno error 71 */
"Too many levels of remote in path" = "Trop de niveaux d’éléments distants dans le chemin";

/* errno error 72 */
"RPC struct is bad" = "Struct. RPC incorrecte";

/* errno error 73 */
"RPC version wrong" = "Version RPC incorrecte";

/* errno error 74 */
"RPC prog. not avail" = "Progr. RPC non disp.";

/* errno error 75 */
"Program version wrong" = "Version du programme incorrecte";

/* errno error 76 */
"Bad procedure for program" = "Procédure du programme incorrecte";

/* errno error 77 */
"No locks available" = "Aucun verrou disponible";

/* errno error 78 */
"Function not implemented" = "Fonction non présente";

/* errno error 79 */
"Inappropriate file type or format" = "Type ou format de fichier inadéquat";

/* errno error 80 */
"Authentication error" = "Erreur d’authentification";

/* errno error 81 */
"Need authenticator" = "Authentificateur requis";

/* errno error 82 */
"Device power is off" = "Périphérique éteint";

/* errno error 83 */
"Device error" = "Erreur du périphérique";

/* errno error 84 */
"Value too large to be stored in data type" = "Valeur trop grande pour le stockage dans ce type de données";

/* errno error 85 */
"Bad executable (or shared library)" = "Exécutable incorrect (ou bibliothèque partagée)";

/* errno error 86 */
"Bad CPU type in executable" = "Type de processeur incorrect dans l’exécutable";

/* errno error 87 */
"Shared library version mismatch" = "Non-concordance de la version de la bibliothèque partagée";

/* errno error 88 */
"Malformed Mach-o file" = "Fichier Mach-o malformé";

/* errno error 89 */
"Operation canceled" = "Opération annulée";

/* errno error 90 */
"Identifier removed" = "Identifiant supprimé";

/* errno error 91 */
"No message of desired type" = "Aucun message du type souhaité";

/* errno error 92 */
"Illegal byte sequence" = "Séquence d'octets illégale";

/* errno error 93 */
"Attribute not found" = "Attribut non trouvé";

/* errno error 94 */
"Bad message" = "Message incorrect";

/* errno error 95 */
"EMULTIHOP (Reserved)" = "EMULTIHOP (réservé)";

/* errno error 96 */
"No message available on STREAM" = "Aucun message disponible sur STREAM";

/* errno error 97 */
"ENOLINK (Reserved)" = "ENOLINK (réservé)";

/* errno error 98 */
"No STREAM resources" = "Aucune ressource STREAM";

/* errno error 99 */
"Not a STREAM" = "Pas un STREAM";

/* errno error 100 */
"Protocol error" = "Erreur de protocole";

/* errno error 101 */
"STREAM ioctl timeout" = "Expiration ioctl STREAM";

/* errno error 102 */
"Operation not supported on socket" = "Opération non gérée sur la socket";

/* errno error 103 */
"Policy not found" = "Règle introuvable";
